test/load/jmeter.log
2018-08-21 06:54:41,672 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2018-08-21 06:54:41,717 INFO o.a.j.JMeter: Loading user properties from: /usr/local/Cellar/jmeter/4.0/libexec/bin/user.properties
2018-08-21 06:54:41,718 INFO o.a.j.JMeter: Loading system properties from: /usr/local/Cellar/jmeter/4.0/libexec/bin/system.properties
2018-08-21 06:54:41,731 INFO o.a.j.JMeter: Copyright (c) 1998-2018 The Apache Software Foundation
2018-08-21 06:54:41,732 INFO o.a.j.JMeter: Version 4.0 r1823414
2018-08-21 06:54:41,732 INFO o.a.j.JMeter: java.version=1.8.0_40
2018-08-21 06:54:41,733 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM
2018-08-21 06:54:41,734 INFO o.a.j.JMeter: os.name=Mac OS X
2018-08-21 06:54:41,734 INFO o.a.j.JMeter: os.arch=x86_64
2018-08-21 06:54:41,734 INFO o.a.j.JMeter: os.version=10.13.6
2018-08-21 06:54:41,734 INFO o.a.j.JMeter: file.encoding=UTF-8
2018-08-21 06:54:41,734 INFO o.a.j.JMeter: Max memory     =1073741824
2018-08-21 06:54:41,735 INFO o.a.j.JMeter: Available Processors =4
2018-08-21 06:54:41,741 INFO o.a.j.JMeter: Default Locale=English (EN)
2018-08-21 06:54:41,741 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2018-08-21 06:54:41,742 INFO o.a.j.JMeter: JMeterHome=/usr/local/Cellar/jmeter/4.0/libexec
2018-08-21 06:54:41,743 INFO o.a.j.JMeter: user.dir  =/Users/ndvan/Projects/phylotastic-portal/test/load
2018-08-21 06:54:41,744 INFO o.a.j.JMeter: PWD       =/Users/ndvan/Projects/phylotastic-portal/test/load
2018-08-21 06:54:41,749 INFO o.a.j.JMeter: IP: 192.168.1.67 Name: booboo FullName: booboo
2018-08-21 06:54:41,752 INFO o.a.j.s.FileServer: Default base='/Users/ndvan/Projects/phylotastic-portal/test/load'
2018-08-21 06:54:41,762 INFO o.a.j.s.FileServer: Set new base='/Users/ndvan/Projects/phylotastic-portal/test/load'
2018-08-21 06:54:42,093 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2018-08-21 06:54:42,129 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2018-08-21 06:54:42,135 INFO o.a.j.s.SaveService: Using SaveService properties version 4.0
2018-08-21 06:54:42,149 INFO o.a.j.s.SaveService: Loading file: ruby-jmeter.jmx
2018-08-21 06:54:42,217 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2018-08-21 06:54:42,217 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2018-08-21 06:54:42,217 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2018-08-21 06:54:42,217 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2018-08-21 06:54:42,217 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2018-08-21 06:54:42,217 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2018-08-21 06:54:42,235 INFO o.a.j.JMeter: Creating summariser <summary>
2018-08-21 06:54:42,251 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2018-08-21 06:54:42,252 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2018-08-21 06:54:42,252 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2018-08-21 06:54:42,258 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2018-08-21 06:54:42,258 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2018-08-21 06:54:42,979 INFO o.a.j.JMeter: Running test (1534856082978)
2018-08-21 06:54:43,036 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : ThreadGroup
2018-08-21 06:54:43,037 INFO o.a.j.e.StandardJMeterEngine: Starting 1 threads for group ThreadGroup.
2018-08-21 06:54:43,037 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2018-08-21 06:54:43,037 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=1 ramp-up=1 perThread=1000.0 delayedStart=true
2018-08-21 06:54:43,041 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2018-08-21 06:54:43,041 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2018-08-21 06:54:43,051 INFO o.a.j.t.JMeterThread: Thread started: ThreadGroup 1-1
2018-08-21 06:54:43,089 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = booboo
2018-08-21 06:54:43,102 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2018-08-21 06:54:43,118 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2018-08-21 06:54:43,118 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to ISO-8859-1
2018-08-21 06:54:43,118 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2018-08-21 06:54:43,118 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2018-08-21 06:55:00,063 INFO o.a.j.r.Summariser: summary +    110 in 00:00:17 =    6.4/s Avg:   152 Min:    75 Max:  2704 Err:     2 (1.82%) Active: 1 Started: 1 Finished: 0
2018-08-21 06:55:30,108 INFO o.a.j.r.Summariser: summary +    229 in 00:00:30 =    7.6/s Avg:   130 Min:    73 Max:   214 Err:     1 (0.44%) Active: 1 Started: 1 Finished: 0
2018-08-21 06:55:30,109 INFO o.a.j.r.Summariser: summary =    339 in 00:00:47 =    7.2/s Avg:   137 Min:    73 Max:  2704 Err:     3 (0.88%)
2018-08-21 06:55:43,142 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: ThreadGroup 1-1
2018-08-21 06:55:43,143 INFO o.a.j.t.JMeterThread: Thread finished: ThreadGroup 1-1
2018-08-21 06:55:43,144 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2018-08-21 06:55:43,146 INFO o.a.j.r.Summariser: summary +    100 in 00:00:13 =    7.7/s Avg:   129 Min:   103 Max:   209 Err:     0 (0.00%) Active: 0 Started: 1 Finished: 1
2018-08-21 06:55:43,147 INFO o.a.j.r.Summariser: summary =    439 in 00:01:00 =    7.3/s Avg:   135 Min:    73 Max:  2704 Err:     3 (0.68%)